midterm/cavity_new/cavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          .1;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep; //writeTime;
        probeLocations
        (
            (0.5 1 0)
            (0.5 0.9 0)
            (0.5 0.8 0)
            (0.5 0.7 0)
            (0.5 0.6 0)
            (0.5 0.5 0)
            (0.5 0.4 0)
            (0.5 0.3 0)
            (0.5 0.2 0)
            (0.5 0.1 0)
            (0.5 0 0)
        );
        fixedLocations  false;
        fields
        (
            U
        );
    }
}


// ************************************************************************* //
